# *將每個功能的Code寫成2個function，每一個function使用一層迴圈*
# *亦即一個 function 不要有兩個迴圈/巢狀迴圈*
# 請使用 while loop或for loop
# 第一個輸入意義為選擇三種圖形:
# 1 直角三角形
# 2 正三角形
# 3 倒三角形

# 第二個輸入意義為畫幾行
# (輸出圖形為數字+底線)

# input
# 1 (第一種圖形：直角三角形)
# 5 (共 5 行)
# --------------------------
# output
# 1
# 121
# 12321
# 1234321
# 123454321
# ---------------------------
# input
# 2 (第二種圖形：正三角形)
# 4 (共 4 行)
# ---------------------------
# output
# ___1___
# __121__
# _12321_
# 1234321
# --------------------------
# input
# 3 (第三種圖形：倒三角形 )
# 3 (共 3 行數)
# ---------------------------
# output
# 12321
# _121_
# __1__